module.exports = {
    // - - - 1 slide
    sayHello: (nameOfUser) => `¡Hola ${nameOfUser}!`,
    welcomeText: '¡Bienvenido al mundo del español! Бот-полиглот рад приветствовать тебя и с удовольствием поможет тебе в изучении испанского языка и достижению твоих целей.',
    learningBenefits: [
        '1. <b>Культурное обогащение:</b> Испанский язык пронизан богатой историей и культурой, которая отразилась в литературе, музыке, искусстве и кулинарии. 📚🎶🎨🍲',
        '2. <b>Расширение возможностей:</b> Знание испанского языка открывает двери к новым возможностям в карьере, путешествиям и международным отношениям. 🌍✈️💼',
        '3. <b>Повышение уровня общения:</b> На испанском языке говорят миллионы людей по всему миру, что дает тебе возможность общаться с разными культурами и людьми. 👥🗣️',
        '4. <b>Умение общаться:</b> Испанский язык – это язык страсти и эмоций, который поможет тебе лучше выражать свои мысли и чувства. ❤️😊'
    ],
    textClassIntro: 'Hola y bienvenido a tu primera clase de español con nosotros!',
    arrClassIntro: [
        'Сегодня мы отправимся в увлекательное путешествие в мир испанского языка, где ты познакомишься с его красотой и магией. Для начала нашего путешествия давай рассмотрим самое основное – испанский алфавит и его удивительное произношение. 🌟📚',
        'Каждая буква испанского алфавита обладает своей уникальной магией, которую мы сейчас раскроем. Давай окунемся в звуки испанского языка и научимся правильно произносить каждую букву так, чтобы ты смог свободно общаться на испанском. 🗣️🎶',
        'После этого мы перейдем к важной части нашего путешествия – фразам приветствия и представления. Уверен, ты мечтал о том, чтобы уверенно здороваться на испанском. Сегодня ты научишься основным фразам приветствия, которые сделают твое общение более теплым. 👋😊',
        'Наконец, мы погрузимся в мир испанской грамматики и начнем изучение основных глаголов, рассмотрим важный глагол <b>"SER"</b> в этом уроке. Они станут основой твоего испанского языка и помогут тебе строить правильные предложения. 📘✍️',
    ],
    textButtonFirstSlide: 'Vamos a aprender más! <i>(Давай узнаем больше</i>)',
    textButtonDigrafs: 'Познакомимся с диграфами?',
    buttonAlfabeto: 'Начнем наш путь с алфавита 😊',
    startFraseDigrafs: `В испанском алфавите, помимо основных букв, есть пять диграфов, которые представляют собой комбинации из двух букв с определенным произношением.📚\n`,
    definitionDigraf: 'ДИГРАФ – сочетание двух букв, которое дает один звук. 🗣️',
    finalTextDigraf: '<b>Эти диграфы являются важными элементами испанского языка и используются в словах для обозначения определенных звуков.</b> 👍',
    // - - - 2 slide
    readingGreetingFrase: '<i>Теперь с уверенностью можно сказать, что ты можешь читать текст (<u>уверены, что безошибочно!</u>)</i>',
    readingGreetingFraseSecond: 'Внимательно ознакомившись и проговорив каждую букву вышеупомянутого алфавита, приступим к заданию. 📖',
    readingGreetingFraseThird: 'Прочтите этот небольшой текст, обращая внимание на ударения (они часто встречаются в испанском языке!) 🔍',
    textSmallPresentation: '<code>¡Hola! Me llamo María. Tengo diez años.\nMe gusta bailar y leer libros.\nVivo en una casa grande con mi familia. Mi mejor amigo se llama Pedro.\nNosotros jugamos al fútbol juntos.</code>',
    explanationsToTheText: 'Прочитай текст несколько раз, пока не переживай о незнании слов и понимании текста.🔄\n<b>Затем запиши голосовое сообщение под чтение этого текста!</b>',
    greatMes: 'Отлично, а теперь послушай, как носитель языка справится с этим текстом!) 👂',
    descriptionFirstText: 'Этот текст представляет собой простое введение и содержит базовые фразы и конструкции, которые могут быть понятны ученикам начального уровня.\n\n<i>Но есть немаловажный нюанс…</i>',
    assentsText: 'Наверняка у вас возникли мысли куда ставить <u>ударения</u> в словах этого текста 🤔',
    // - - - 3 slide
    assents: 'Наверняка у вас возникли мысли куда ставить ударения в словах этого текста 🤔',
    stressPenultimateSyllable: 'Если слово оканчивается на любую гласную, либо на согласные n и s – ставим ударение на предпоследний слог, но не пишем его.\n\n💢Примеры:\nmesa (стол) - me-sa\ngato (кот) - ga-to\nhablan (они говорят) - ha-blan\nchico (мальчик) - chi-co\nsillas (стулья) - si-llas',
    emphasisTheLastSyllable: 'Если слово оканчивается на любую согласную, кроме n и s – ставим ударение на последний слог, но не пишем его.\n\n💢Примеры:\nhotel (отель) - ho-tel\nreloj (часы) - re-loj\narroz (рис) - ar-roz\npapel (бумага) - pa-pel\nfeliz (счастливый) - fe-liz',
    exceptionsForAccent: 'Если нарушается любой из первых двух пунктов – ударение пишется\n\n💢Примеры:\ncafé (кофе) - ca-fé\nsofá (диван) - so-fá\ncamión (грузовик) - ca-mión\ninglés (английский) - in-glés\ncomeré (я буду есть) - co-me-ré',
    reglasSimples: 'Простые правила ударения помогут понимать, как правильно произносить испанские слова.',
    textGranPresentation: `
        <code>¡Hola! Mi nombre es Juan. Tengo doce años y vivo en una pequeña ciudad cerca del mar. Me encanta jugar al fútbol con mis amigos en la playa y nadar en el océano. También me gusta dibujar y leer cómics en mi tiempo libre. Vivo en una casa bonita con mis padres y mi hermana menor. Mi mejor amigo se llama Miguel y juntos exploramos los senderos del bosque cercano. Nos divertimos mucho jugando al aire libre y descubriendo nuevas aventuras.</code>
        `,
    explanationsToTheTextGran: 'Прочитай текст несколько раз, пока не переживай о незнании слов и понимании текста.\n    Затем запиши голосовое сообщение!',
    transitionMainGreetings: 'Основные фразы приветствия и представления.',    
    // - - - 4 slide
    openingPhraseMainGreetings: 'Потрясающе, а мы переходим к следующему разделу нашего урока: Основные фразы приветствия и представления. 😊',
    holaOpening: 'Основные фразы приветствия и представления на испанском языке:',
    hola: '<code>¡Hola! (Привет!)</code> 👋',
    holaDescription: '«Hola» — это приветствие, которое подходит для любого времени суток. Это слово можно перевести на русский как «привет» или «здравствуйте». 😊',
    holaDescriptionLarge: 'Слово <b>«hola»</b> используется для приветствия как друзей, так и незнакомых людей. Вместо этого некоторые предпочитают более формальные выражения, такие как <i>"buenos días"</i> или <i>"buenas tardes"</i>, особенно в рабочей обстановке или при знакомстве с новыми людьми. Несмотря на это, <b>"hola"</b> остается универсальным приветствием, подходящим для большинства ситуаций, за исключением очень официальных встреч.',
    buenos_dias_noches: '<b><i>Обратите пристальное внимание на эти фразы</i></b>: в испанском языке есть по три приветствия на каждое время суток. Их перевод не всегда точно соответствует дословному значению. Это объясняется тем, что у испанцев распорядок дня отличается от русского: активная жизнь начинается и заканчивается гораздо позднее, чем в России.',
    horarioDeUseBuenosTardes: '<b>Buenas tardes</b> - Используется в период времени с 12:00 до 20:00  ☀️',
    horarioDeUseBuenosNoches: '<i>Buenas noches</i> - Это приветствие обычно используется после 20:00. Фраза также используется в вечернее время для прощания или перед тем, как отойти спать или пожелать доброй ночи. 🌙',
    endOfGreetings: '<i>На самом деле не стоит сильно заморачиваться над временем употребления этих выражений, оно не настолько строгое, как может показаться.</i>',
    farewell: 'Прощание: <b>adiós</b> и <b>hasta luego</b>',
    farewellBegining: 'Прощание на испанском языке часто выражается двумя основными фразами: <i>"adiós"</i> и <i>"hasta luego"</i>.\nВот их значения:',
    adios: '<code>Adiós</code>',
    farewellDescription: 'Это наиболее формальное прощание, которое можно перевести как <b>"до свидания"</b>.\nОбычно оно используется, когда вы прощаетесь на длительный период времени или когда не уверены, когда снова увидитесь.',
    hastaLuego: '<code>Hasta luego</code>',
    hastaLuegoDescription: 'Это более неофициальное прощание, означающее <b>"до скорого"</b>.\nОбычно оно используется, когда вы надеетесь увидеться с человеком в ближайшем будущем или когда прощаетесь временно, например, на короткий перерыв или встречу.',
    farewellLargeConclusion: '<b>Обе фразы подходят для различных ситуаций и помогают участникам разговора вежливо завершить беседу.</b>',
    buttonFarewells: 'Какие формы прощания вы можете встретить еще?)',
    // - - - 5 slide
    verbosTheme: 'Глагол <b>SER</b> 🙋',
    firstPhrase: '<i>Супер, потихоньку начинаем заныривать в язык</i>\n\nДалее нас ждет блок с базовыми глаголами, их употреблением и структурой образования и работы с глаголами в espanol’e)',
    verbosFirstPresentation: `<b>Глаголы</b>
    <pre>
    |  Глагол  |     Значение    |
    |----------|-----------------|
    |   ser    |       быть      |
    </pre>
    `,
    serVerbInfo: `
    <b>Глагол "ser":</b> ⚡

<b>Значение:</b> "Ser" обозначает постоянное состояние, суть или идентичность объекта или лица. 📚

<b>Примеры:</b>
- <i>Soy estudiante.</i> (Я студент.) 🎓
- <i>Ella es alta.</i> (Она высокая.) 📏
- <i>Somos amigos.</i> (Мы друзья.) 🤝
    `,
    preparingForPronouns: '<i>Наверное, вас смутило, почему в трех использованных вариантах совершенно разное использование и написание этого глагола?</i>',
    calmPronounce: 'Но чтобы продвинуться нам с глаголами, придеться зацепить и <b><i>местоимения</i></b>, не переживай, они не столь сложны)',
    pronounceDescription: `
    <b>Пока поговорим о личных местоимениях</b> 🗣️

Личные местоимения используются для обозначения людей или предметов в предложении. В испанском языке они могут меняться в зависимости от лица, числа и рода. Вот основные личные местоимения в испанском:
    `,
    pronounContext: `
    <b>Эти местоимения используются в предложениях для указания на различные лица и их роли в контексте общения. Например:</b> 💬

    - <i>Я говорю:</i> <b>Yo hablo.</b> 🗣️
    - <i>Он читает:</i> <b>Él lee.</b> 📖
    - <i>Мы пишем:</i> <b>Nosotros escribimos.</b> ✍️
    `,
    dependenceOfContext: 'Помните, что в испанском языке форма местоимения может изменяться в зависимости от <i>контекста</i> и <i>вежливости общения</i>, поэтому важно учитывать соответствующие формы в различных ситуациях.',
    // - - - 6 slide
    highlightSpanish: `
    <b>Изюминка испанского языка состоит в том, что форма глагола подстраивается под местоимение, и форма может меняться достаточно сильно. ✨</b>

    В испанском языке глаголы изменяют свою форму в зависимости от местоимения и времени, что называется <i>спряжением глаголов</i>. 🔄
    `,
    // - - - Ser
    textExercise: '<code>Упражнение\n(В упражнениях будут встречаться прилагательные, местоимения, которые придется использовать в разных формах в зависимости от рода и числа, на данном этапе постарайся догадаться интуитивно)</code>',
    descrOfPersonalityAppearance: '<b>Описание личности и внешности:</b> 👤🎨 "Ser" используется для описания тех характеристик, которые считаются постоянными или неизменными, таких как возраст, рост, вес, цвет волос и глаз.',
    descrOfIdentification: '2. <b>Идентификация:</b> 🆔 Глагол "Ser" используется для идентификации объекта или лица.\n- Пример: <i>Ella es mi hermana. (Она - моя сестра.)</i>',
    descrOrigin: '3. <b>Происхождение:</b> 🏡🌍 Он также используется для указания на место происхождения или национальности.\n\n- Пример: <i>Soy de España. (Я из Испании.)</i>',
    descrMaterialObject: `
    <b>Материал или характеристики объекта:</b> 🏷️🔍 "Ser" используется для описания материала, из которого сделан объект, или его основных характеристик.

- Пример: <i>La mesa es de madera. (Стол из дерева.)</i>

Обрати внимание, что в испанском обязательным элементом использования существительных являются артикли.

<i>Артикли в испанском языке включают определенные (definidos) и неопределенные (indefinidos) формы, которые используются для указания на определенность или неопределенность существительных. Вот основные типы артиклей в испанском:</i>
    `,
    descrTimeDate: `
    5. <b>Время и дата:</b> 🕒📅 Глагол "Ser" также используется для выражения времени и даты.
- Пример: <i>Son las tres de la tarde. (Три часа дня.)</i>

На данный момент мы с тобой не знакомы ни с числами, ни с днями недели) но пока давай потренируемся с примерами)

<i>При употреблении дней недели артикль не требуется, потому что день недели выступает в качестве имени и не требует определения. Также это стандартная практика в испанском языке при выражении дней недели и времени.</i>
    `,
    // - - - days of week
    daysWeekDescr: 'Ничего сложного, но принцип работы с днями недели в испанском немного отличается)\n\nВ испанском языке дни недели имеют следующие названия:',
    daysWeekConclusion: `
    🗓 <b>Обратите внимание, что в испанском языке дни недели не пишутся с заглавной буквы, за исключением случаев, когда они начинают предложение.</b>

    📅 Эти слова можно использовать с предлогом <b>"el"</b> для обозначения конкретного дня:

    - 🗓 <b>El lunes</b> (в понедельник)
    - 🗓 <b>El sábado</b> (в субботу)

    📆 Или без предлога для выражения действия, которое происходит в определенный день недели:

    - 💼 <b>Trabajo los martes.</b> (Я работаю по вторникам.)
    `,
};
